[
  {
    "tender_id": "6894637b0a538a22d8000001",
    "url": "https://tender.2merkato.com/tenders/6894637b0a538a22d8000001",
    "title": "አሰር ኮንስትራክሽን ኃ/የተ/የግ/ኩባንያ የተለያየ ዓይነት ያገለገሉ የሬንጅ በርሜል ባሉበት ሁኔት በጨረታ አወዳድሮ መሸጥ ይፈልጋል",
    "description": "Please read the detailed instructions below. ከስር የተጠቀመጠውን እያንዳንዱን መረጃ በጥንቃቄ ያንብቡ።\nቀን 01/12/2017ዓ.ም\nጨረታማስታወቂያቁጥር35/2017\nአሰርኮንስትራክሽንኃ/የተ/የግ/ኩባንያከዚህበታችበሰንጠረዥየተጠቀሰዉንየተለያየዓይነትያገለገሉየሬንጅበርሜልባሉበትሁኔትበጨረታአወዳድሮመሸጥይፈልጋል፡፡\nስለሆነምዕቃውንመግዛትየምትፈልጉተጫራቾችወይንምሕጋዊወኪሎቻቸውበጨረታውመሳተፍይችላሉ፡፡\nበመሆኑምነሐሴ1ቀን2017ዓ.ምጀምሮየማይመለስቫትንጨምሮብር115.00 /አንድመቶአስራአምስት/በመክፈልየጨረታሰነድመግዛትየሚቻልመሆኑንእንገልፃለን፡፡\nበጨረታውለመወዳደርመሟላትየሚገባቸውማስረጃዎች\n1.ማንኛውምተጫራችለሚጫረቱትለእያንዳንዱዕቃነጠላዋጋእናጠቅላላዋጋበተያያዘውዝርዝርመሠረትከቫትበፊትእናከቫትጋርመሆኑንበግልጽበኤንቨሎኘታሽጐማቅረብይኖርበታል፡፡\n2.ተጫራቾችህጋዊየንግድፈቃድያላቸውየዘመኑንግብርየከፈሉበትንማስረጃአያይዘውማቅረብየሚችሉበተጨማሪምየተጨማሪእሴትታክስ/VAT/ወይምቲ.ኦ.ቲ/TOT/ተመዝጋቢመሆናቸውንየሚያረጋግጥማስረጃማቅረብየሚችሉመሆንይኖርባቸዋል፡፡\n3.ይህጨረታማስታወቂያውከወጣበትቀንጀምሮባሉትሰባት/ 7 /ተከታታይየሥራቀናትውስጥዘወትርበስራሰዓትበድርጅቱዋናመ/ቤትአቅርቦትመምሪያቢሮበመቅረብየጨረታሰነድመግዛትይችላሉ፡፡\n4.ተጫራቾችለጨረታውማስከበሪያዋስትናየሚያቀርቡትንዋጋ5%በአሰርኮንስትራክሽንኃላ/የተ/የግ/ኩባንያስምበተዘጋጀCPOበተናጠልበታሸገፖስታማስገባትይኖርባቸዋል፡\n5.ጨረታውነሐሴ8ቀን2017ዓ.ምከቀኑ8፡00ሰዓትተዘግቶነሐሴ8ቀን2017ዓ.ምከቀኑ8፡30ተጫራቾችወይምህጋዊወኪሎቻቸውበተገኙበትይከፈታል፡፡ሆኖምየመክፈቻቀንቅዳሜ፣እሁድወይምየበዓላትቀንከዋለበሚቀጥለውየሥራቀንበተመሳሳይሰዓትይሆናል።\n6.ተጫራቾችየሚጫረቱትንንብረትአካባቢንበማይበክልእናበሰዎችምላይየጤናእክልበማያስከትልሁኔታጥቅምላይለማዋልዋስትንበጽሁፍማቅረብየሚችሉመሆንአለባቸው።\n7.አሸናፊድርጅት/ግለሰብላሸነፉትንብረተበ5ቀናትውስጥሙሉክፍያውንበመክፈልበ15ቀናትውስጥበራሳቸውትራንስፖርትጭነውዕቃውንማንሳትየሚጠበቀባቸውሲሆንይህባይሆንግንጨረታውተሰርዞለጨረታውያስያዙትገንዘብለድርጅቱገቢይሆናል፡፡\n8.የጨረታሰነድበሚያስገቡበትወቅትቅድመሁኔታጽፎማቅረብከውድድርእንዲሰረዝያደርጋል።\n9.ኩባንያውየተሻለመንገድአማራጭካገኘጨረታውንሙሉበሙሉወይምበከፊልየመሰረዝመብቱበህግየተጠበቀነው\nማሳሰቢያ፡-ሁሉምለጨረታየቀረቡዕቃዎችየሚሸጡትባሉበትቦታናሁኔታመሆኑንእንገልፃለን፡፡\nተጫራቾችመረጃከፈለጉ\n☞፡011 639-2064መደወልይችላሉየዋናመ/ቤትአድራሻከቀድሞኢምፔሪያልሆቴልአጠገብከሚገኘውዲኤችገዳጀርባ\nለጨረታየቀረቡየንብረትዝርዝር\nየዕቃውዓይነት\nመለኪያ\nመጠን\nነጠላዋጋ\nጠቅላላዋጋ\nየሚገኝበትቦታ\nባዶየሬንጅበርሜልባለበት\nበቁጥር\n4500\nየታኮትበርሜል\nበቁጥር\n75\nድምር\nቫት15%\nጠቅላላድምር",
    "filed_under": "Metal and Metal Working, Sales, Disposals and Foreclosure, Steel, Metals and Aluminium",
    "company": "Aser Construction P.L.C.",
    "bid_closing_date": "Aug 14, 2025 2:00 PM",
    "bid_opening_date": "Aug 14, 2025 2:30 PM",
    "published_on": "2merkato.com(Aug 07, 2025)",
    "posted": "August 07, 2025",
    "bid_document_price": "115.00 ብር",
    "bid_bond": "5%",
    "region": "Addis Ababa",
    "bidding_type": "Closed"
  },
  {
    "tender_id": "68945a400a538aaedc000001",
    "url": "https://tender.2merkato.com/tenders/68945a400a538aaedc000001",
    "title": "The United Nations Economic Commission for Africa (UNECA) seeks to engage a qualified Building and Construction/maintenance and repair Services Contractor to provide Construction/ maintenance Services for its headquarters in Addis Ababa, Ethiopia",
    "description": "Please read the detailed instructions below. ከስር የተጠቀመጠውን እያንዳንዱን መረጃ በጥንቃቄ ያንብቡ።\nREQUEST FOR EXPRESSION OF INTEREST (EOI)\nThis notice is placed on behalf of UNECA. You are therefore requested to direct all your queries to United Nations Economic Commission for Africa using the e-mail address provided below:\nTitle of the EOI: THE PROVISION OF ZAMBEZI BUILDING EXTERNAL WALLS GRANITE CLADDING REPLACEMENT PROJECTDate of this EOI: 06 August 2025Closing Date for Receipt of EOI: 21 August 2025EOI Number: EOIUNECA23791E-mail Address:mamod@un.orgassaad@un.orgAddress EOI response by fax for the Attention of: Daniel Mamo/ Ali AssaadFax Number:UNSPSC Code: 81101508,72100000,72101500,72101507\nDESCRIPTION OF REQUIREMENTS\nThe United Nations Economic Commission for Africa (UNECA) seeks to engage a qualified Building and Construction/maintenance and repair Services Contractor to provide Construction/ maintenance Services for its headquarters in Addis Ababa, Ethiopia.\nThe United Nations Economic Commission for Africa (UNECA) is committed to ensuring the safety, functionality, and long-term sustainability of its campus infrastructure. To uphold this commitment, ongoing upgrades and improvements are implemented to enhance both existing and future developments. One of the current planned upgrades is the replacement of the mechanical hanging system for the external granite cladding of the Zambezi Building.\nThe Zambezi Building is an eight-story office building (Basement + Ground + 6 Upper Floors + Roof Terrace). Construction began in 2010 and resumed in June 2014. The building is organized along an east-west axis, consisting of two main rectangular volumes connected by a central core. Cylindrical open staircases at either end enhance the building’s safety by providing dedicated escape routes. The external façade is finished with plaster and paint, glazing, and granite cladding.\nThe building façade incorporates granite cladding, covering an area of approximately 3,100 square meters. Each granite tile measures 600 x 300 x 20 mm. Two fixing methods were originally used for installation:\nOver time, multiple defects have been observed in the cladding system. Some tiles have completely detached and fallen, while others remain loose or partially delaminated\nCompanies expressing interest should note that this Request for Expression of Interest (REOI) serves as pre-qualification of the companies that will be invited to participate in the tender process. Intersted firms will be invited to the tender by \"Request for Proposal -RFP\" at later stage and the detail requirement will be further specified in the RFP document.\nUNECA reserves the right to change or cancel the requirements at any time during the EOI/ or solicitation process. Thus, submitting a reply to this EOI does not automatically guarantee that your company will be considered for receipt of the solicitation when issued. The RFP and any subsequent commitment to contract will be issued in accordance with UN rules and regulations.\nUNECA is precluded from entering into contract with a vendor that is not registered with United Nations Global Market Place(UNGM). Thus, only those vendors who are registered or provisionally registered or have started their registration process in UNGM will be eligible to receive the solicitation document RFP. Those interested in responding to this EOI but not currently registered as vendors with UNGM, are encouraged to register before submission date for closing of the EOI in the United Nations Global Market Place (UNGM). Further details may be obtained by visitinghttps://www.ungm.org/Vendor/Registration. In order to be eligible for UN Registration, please make sure to declare in writing the Prerequisite for Eligibility criteria itemized from A-F as contained in EOI instruction attached.\nThe successful bidder will be required to register in UNGM at Level 2 before the Contract award.\nThose interested vendors who fulfill the above requirements are required to express their interest in this EOI electronically. In case you have difficulties submitting your interest electronically, please contact:mamod@un.org/ ( copy to:assaad@un.org)on or before the closing date of 21 August 2025.\nSPECIFIC REQUIREMENTS / INFORMATION (IF ANY)\nVendors interested in participating in the planned solicitation process should submit the vendor Response Form of this EOI electronically through the linkhttps://www.ungm.org/Public/Notice/274688(athttps://www.ungm.org/Public/Notice/27468)before the closing date set for the above.",
    "filed_under": "Consultancy, Construction and Water Works, Maintenance and Repair",
    "company": "The United Nations Economic Commission for Africa (UNECA)",
    "bid_closing_date": "Aug 21, 2025 5:59 PM",
    "bid_opening_date": "No Specific Opening Date and Time",
    "published_on": "2merkato.com(Aug 07, 2025)",
    "posted": "August 07, 2025",
    "region": "Addis Ababa",
    "bidding_type": "Open"
  }
]