[
  {
    "tender_id": "68a72b920a538a71e7000001",
    "url": "https://tender.2merkato.com/tenders/68a72b920a538a71e7000001",
    "title": "Last Mile Health Invites Eligible Bidders for the Procurement of Selection of Logistics management company",
    "description": "REQUEST FOR PROPOSALS FOR Selection of Logistics management company\nOverview of Last Mile Health\nLMH began in Liberia’s remote, last-mile communities and is now growing to support four countries in sub-Saharan Africa aiming to deploy 50,000 CHWs to serve 100 million patients. Across Ethiopia, Liberia, Malawi, and Sierra Leone, LMH partners with the government to strengthen health systems, upskill the health workforce and deliver community-based care and treatment. Over the next decade, LMH hopes to catalyze a critical mass of exemplary government-led community health systems, delivering quality primary care for last-mile communities in low and middle-income countries. Since 2007, we’ve partnered with governments across Africa to mobilize professional community health workers who provide lifesaving primary care in some of the world’s most remote communities. When professional community health workers are equipped with the right kinds of support, they can transform access to care at the last mile. Our core work is partnering with governments to unlock this potential at scale.\nIntroduction and Background to the Project\nAt Last Mile Health, we believe healthcare is a fundamental right for all. We equip Health Extension Workers with the knowledge and skills they need to improve the quality of care for rural communities. We extended that commitment by addressing eye health through the Livelihood Impact Fund Project focusing on reading glasses distribution at the community level. This initiative is part of our broader non-communicable disease blended training module, which includes eye care. With effective collaboration between the LMH team, Ministry of health, health extension workers and other stakeholders, we’ve made significant progress to improve community members affected by presbyopia in remote areas.\nConsequently, over 27,000 eyeglasses were successfully distributed under the pilot project.Building on the success of the pilot, Last Mile Health intends to commence the full implementation of the project which will involve distribution of 355,000 eyeglasses.\nThe purpose of this procurement is to engage a logistic management company for the storing, transportation and delivering of eyeglasses to the designated location to ensure efficient implementation of the project. This phase of the implementation will be extensive and will cover a wider area therefore the need to engage a service provider for smooth implementation.\nInstructions to participating firms\n3.1 Last Mile Health (LMH) will select a firm among those participating in the procurement process in accordance with the method of selection specified in this RFP and any other additional information shared in connection with this procurement process.\n3.2 Interested firms are invited to submit a Technical Proposal and Financial Proposal for Logistics management services as specified herein. The Proposals will be the basis for contract negotiations and ultimately for a signed contract with the selected firm.\n3.3 The services shall be implemented in accordance within the timeline and period specified in the specification/terms of reference (TOR). The performance of the Company under each phase (if phased) must be to LMH's satisfaction before work begins on the next phase.\n3.4 The firms participating in the process must familiarize themselves with local conditions and take them into account in preparing their Proposals. To obtain first-hand information on the assignment and the local conditions, the firms are encouraged to visit the LMH before submitting a proposal where necessary and to attend a pre-proposal conference if any. The Firms’ representative should contact the officials named and address provided in this RFP and schedule their visit or to obtain any additional information or pre-proposal conference.\n3.5 The Bidder shall bear all costs associated with the preparation and submission of its Proposal, and LMH shall not be responsible or liable for those costs, regardless of the outcome of the selection process. Last Mile Health is not bound to accept any proposal or submission. Last Mile Health reserves the right to cancel the selection process at any time prior to Contract award without incurring any liability to the Bidder.\n3.6 In preparing the Proposal, the Bidder is expected to examine the RFP in detail. In providing the information requested in the RFP, any deficiency considered to be material may result in rejection of the Proposal.\n3.7 The Proposal and all associated correspondence as well as documents relating to the submission or Proposal exchanged between the Bidder and LMH, shall be written in English.\n3.8 Each firm or any Joint Venture shall submit only one Proposal in any procurement process, either in its own name or as part of a Joint Venture. If a Bidder/firm, including any Joint Venture member, submits or participates in more than one proposal, all such proposals shall be disqualified and rejected. This includes a Sub-Contractor and staff named as key staff in the participating firm Proposal.\n3.9 Bids or proposals submitted must remain valid for a period of 90 days after the submission deadline. During this period, the Bidders or bidding firm shall maintain its original Proposal without any change. This includes the Key Experts as well as the proposed rates and the total price.\n3.10 If it is established that any Key staff nominated in the Bidder’s Proposal was not available at the time of submission or submitted without his/her confirmation, such Proposal shall be disqualified and rejected from further evaluation.\n3.11 Last Mile Health will take every step possible to complete every process within the Bid validity period. However, where the need for extension arises, LMH may request, in writing, all participating firms who submitted Proposals prior to the submission deadline to extend the Bids’ validity before the expiry of the period. If the Bidder agrees to extend the validity of its Proposal or submission, it shall be done without any change in the original Proposal and with the confirmation of the availability of the Key Experts. A Bidder has the right toreject any validity extension request, however such Proposal will not be further evaluated.\n3.12 In any case, if any of the Key Experts become unavailable for the requested extended validity period, the Bidder will provide a written justification to the LMH. The replacement Key Expert shall have equal or better qualifications and experience compared to those of the originally proposed Key Expert. The technical evaluation score of key staff will remain unchanged even though there has been a replacement. If the Bidder fails to provide a replacement Key Expert with equal or better qualifications such Proposal will be rejected. In addition if reasons or justification for Key Expert replacement are unacceptable to LMH, such Proposal will be rejected.\n3.13 All clarification requests should be submitted to LMH by the Clarification Deadline, as set out in the Timescales section of this RFP. LMH is under no obligation to respond to clarification requests and will respond if the question is appropriate and received before the Clarification Deadline. Any clarification requests should clearly reference the appropriate paragraph in the RFP documentation and, to the extent possible, should be aggregated or put together in a single email or letter whichever is convenient to the Bidder. LMH reservesthe right to issue any clarification request made by you, and the response, to all potential suppliers unless you expressly require it to be kept confidential at the time of the request and same is believed to be justifiable in the opinion of LMH.\n3.14 LMH may at any time request further information from potential suppliers to verify or clarify any aspects of their Proposal or other information they may have provided. Should you not provide supplementary information or clarifications to LMH by any deadline notified to you, your Proposal may be rejected in full and you may be disqualified from this procurement process.\n3.15 LMH may amend the RFP by issuing an amendment in writing or by standard electronic means at any given time prior to proposal submission deadline. The amendment shall be sent to all participating firms and will be binding on them. All participating firms of bidders shall acknowledge receipt of all amendments in writing. Bidders on the other hand may submit a modified Proposal or a modification to any part of their submission any time prior to the proposal submission deadline. Under no circumstance any modifications to the Technical or Financial Proposal shall be accepted after the submission deadline.\n3.16. LMH reserves the right to cancel this RFP, in whole or in part, at any time prior to the announcement of a winning bidder, without liability to any bidder.\n6.0 Timescales for the Procurement process\n6.1 Subject to any changes which Bidders would be notified accordingly, if occurred, the intended timescales applicable to this Procurement Process are stated below:\nActivity\nDate/time\nRFPIssuedtobiddingsuppliers\nAugust20,2025\nDeadline for clarification questions(Clarification Deadline)\nAug28,2025\nRespondtoclarificationquestionsfromBiddersbyLMH\nAswhenreceived\nDeadlineforsubmissionofProposalsbypotentialBidders\nSeptember4,2025\nClarificationsessionandornegotiations\nSeptember 12,2025\nFinalDecision/awardrecommendation\nSep15,2025\nContractdate\nSep16,2025\nContractstart date\nSep17,2025\nExpectedContract enddate\nMay31,2026\nRoles and Responsibilities:\na.  Buyer\nb.  Supplier\nEvaluation Criteria:\nRefer to the table at section 4.1 for detailed evaluation criteria.\nReporting Requirements:\nEligibility\nAll interested bidders must meet the below requirements: Valid Tax Clearance Certificate;\nValid Commercial Registration Certificate; Valid Business License;\nList of similar work done in the last five years;\nList of References, at least Three (3), including contact information (Name of Contact person, valid Phone Numbers and Email addresses).\nSubmission Requirements:\nSubmissions must be addressed to the Country director. The preferred version is pdf. Deadline for submission isSeptember 4, 2025.\nInterested eligible bidders may express their interest by responding to this RFP with their proposal on or before the stated deadline above. Any bids submitted after the deadline shall not be accepted.\nAll submissions in response to this tender and/or correspondence must be sent toglobalprocurement@lastmilehealth.org, addressed to the Country Director with the address below. The subject line should read ‘’Logistics management company Tender’’\nCountry DirectorLast Mile HealthAttention: Yealem Mehari Bole Sub-city, W04, H.No 321 Addis Ababa, Ethiopiaglobalprocurement@lastmilehealth.org",
    "filed_under": "Safety and Security, Warehousing, Transit and Transport Service, Consultancy",
    "company": "Last Mile Health",
    "bid_closing_date": "Sep 04, 2025 5:30 PM",
    "bid_opening_date": "No Specific Opening Date and Time",
    "published_on": "2merkato.com(Aug 21, 2025)",
    "posted": "a day ago",
    "region": "Addis Ababa",
    "bidding_type": "Open"
  }
]